export default {
  signUp: 'Реєстрація',
  signIn: 'Вхід',
  forgotPas: 'Забули пароль?',
  nonPage: 'Ця сторінка не існує, будь ласка, поверніться на головну',
  about: 'Головне',
  write: "Написати",
  favoriteText: 'У вас немає вподобань, скористайтеся платформою та знайдіть їх',
  OwnerAbout: 'Тут немає інформації про вас, використовуйте платформу, щоб додати',
  UserAbout: 'Тут немає інформації про користувача',
  OwnerPhotos: 'У вас немає фотографій, натисніть кнопку нижче, щоб додати одну',
  UserPhotos: 'У користувача немає фотографій',
  years: '0 років | {n} рік | {n} роки | {n} років',
  posts: 'Дописи',
  favorite: 'Вподобання',
  like: 'Лайк',
  nope: 'Ні',
  opss: 'Упсс, здається, більше немає зображень',
  usersTexts: 'Що говорять наші користувачі',
  logOut: 'Вийти',
  texts: [
    'Я не вірив, що зможу знайти свою другу половинку онлайн, але ця платформа мене вразила! Тут я познайомився з веселими та цікавими людьми, і один з них став моїм коханим. Дякую, що змінили моє життя!',
    'Я довго шукав стосунків, але не знайшов того, що шукав. Завдяки цій платформі я познайомився з красивою жінкою, з якою у нас багато спільних інтересів. Тепер моє серце належить їй.',
    'Все починалося природно, а вийшло несподівано круто! Тут я зустрів свою дівчину, і тепер ми плануємо спільне майбутнє. Дякую, що ви є і допомагаєте людям знаходити кохання.'
  ],
  infoTitle: ['Широкий вибір профілів', 'Безпека та конфіденційність', 'Розумний підбір партнерів'],
  infoText: [
    'У нас є різноманітні профілі користувачів із різних куточків світу. Є місце для кожного, хто шукає кохання або просто розважається.',
    'Ми дбаємо про вашу безпеку та конфіденційність. Ваші дані захищені та не будуть передані третім особам. Таким чином, ви можете насолоджуватися процесом знайомства без зайвих турбот.',
    'Наші алгоритми враховують ваші інтереси, хобі та особистість, щоб кожне знайомство було максимально успішним і приємним.'
  ],
  accordionTitle: [
    'Чи безпечно використовувати цю платформу?',
    'Тут є справжні анкети?',
    'Які особливості роблять нашу платформу унікальною?',
    'Як отримати підтримку, якщо вона потрібна?'
  ],

  accordionText: [
    'Так, наш сайт використовує передові технології для захисту особистої інформації та забезпечення безпеки користувачів.',
    'Так, ми проводимо ретельну перевірку даних, щоб переконатися в автентичності та серйозності наших користувачів.',
    'Ми пропонуємо інноваційні інструменти для полегшення знайомств і глибшого спілкування між користувачами.',
    "Наша служба підтримки доступна 24/7. Зв'яжіться з нами, і ми готові допомогти вам у будь-який час."
  ],
  legal: 'Юридичний',
  footerText: `Самотні люди, послухайте: якщо ви шукаєте кохання, хочете почати зустрічатися або просто
   будьте невимушеними, вам потрібно бути на AmurArrow. Зібрано понад 55 мільярдів збігів, це саме те місце
    щоб зустріти свій наступний найкращий матч. Давайте будемо правдою, ландшафт знайомств виглядає зовсім інакше
    сьогодні, оскільки більшість людей зустрічаються онлайн. З AmurArrow, найпопулярнішим у світі безкоштовним сервісом знайомств
    додаток, у вас під рукою мільйони інших самотніх людей, і вони всі
     готовий зустріти такого, як ти. Незалежно від того, чи ви натуралісти чи належите до спільноти ЛГБТКІА,
     AmurArrow тут, щоб принести вам усі іскри. Тут справді знайдеться щось для кожного
     AmurArrow. Хочете вступити в стосунки? Ти зрозумів. Намагаєшся знайти нових друзів? Казати
     не більше. Нова дитина в університетському містечку і хоче отримати максимум від свого навчання в коледжі?
     AmurArrow U допоможе вам. AmurArrow — це не звичайний сайт знайомств — це найбільше
     різноманітний додаток для знайомств, куди запрошуються дорослі з будь-яким походженням і досвідом
     зв’язки, спогади та все, що між ними.`,
  privacy: 'Конфіденційність',
  terms: 'Умови',
  cookiePolicy: 'Політика файлів cookie',
  intellectualProperty: 'Інтелектуальна власність',
  FAQ: 'FAQ',
  destination: 'Destanations',
  pressRoom: 'Прес-центр',
  contact: 'Контакт',
  promoCode: 'Промо-код',
  careers: "Кар'єри",
  careersPortal: "Портал кар'єри",
  techBlog: 'Технічний блог',
  social: 'Соціальні мережі',
  safetyTips: 'Поради з безпеки',
  privacySettings: 'Налаштування конфіденційності',
  footerDate: '© 2023 Match Group, LLC, усі права захищено',
  dateWay: 'Побачення по-своєму',
  contentText: `Ласкаво просимо на нашу платформу знайомств, де ви можете знайти свого ідеального партнера чи просто
     цікаві співрозмовники. Ми створили цей сайт, щоб ви могли відчути всю
     магію онлайн-знайомств і відкрити для себе багато можливостей.`,
  getStarted: 'Почати',
  aproveMessage: [
    'Непереможений у басейні? Ви зустріли',
    'свого партнера!',
    'Виклик прийнятий.',
    'Ви коли-небудь грали у The Cave?',
    'Так! Ми повинні поїхати',
    'цими вихідними!'
  ],
  whySite: 'Чому цей сайт?',
  becauseSite: `Цей сайт є ідеальним вибором для тих, хто шукає цікавих та відповідних
     співрозмовників. Завдяки різноманітності профілів ви зможете знайти людей, які поділяють
     ваші інтереси та цінності. Нашою головною турботою є безпека наших користувачів, і ми використовуємо
     передові технології для забезпечення конфіденційності та захисту особистої інформації.
     Крім того, наш сайт постійно оновлюється інноваційними функціями, які роблять процес знайомства
     захоплюючим і продуктивним. Наша чуйна служба підтримки готова допомогти в будь-який час,
     створення позитивної спільноти та збереження вашого досвіду знайомств.`,
  learnMore: 'Дізнатися більше',
  profile: 'Профіль',
  noLikes: 'У вас не було жодного лайка за останні 24 години',
  more: 'Більше',
  Email: 'Емейл',
  Username: 'Логін',
  Male: 'Чоловік',
  Female: 'Жінка',
  Gender: 'Стать',
  Password: 'Пароль',
  Confirm: 'Підтвердити пароль',
  suggestions: 'Пропозиції',
  suggestionsText: [
    'Принаймні одна велика літера',
    'Принаймні одна мала буква',
    'Принаймні одне число',
    'Мінімум 8 символів'
  ],
  first: "Ім'я",
  last: 'Прізвище',
  Age: 'Вік',
  country: 'Країна',
  region: 'Регіон',
  selectCountry: 'Обрати країну',
  selectRegion: 'Обрати регіон',
  defUploadImage:
    'Завантажуйте зображення за допомогою діалогового вікна вибору файлу або перетягуванням бажаних зображень у виділену область',
  imageTooLarge: 'Розмір зображення завеликий, виберіть зображення менше 10 МБ',
  notImage: 'Це не фото, будь ласка, завантажте зображення',
  chooseImage: 'Виберіть зображення',
  Title: 'Назва',
  Description: 'Опис',
  emailIsNotValid: 'Не дійсна електронна адреса',
  emailIsRequired: 'Потрібна електронна адреса',
  emailInUse: 'Цей обліковий запис уже існує',
  passwordIsRequired: 'Потрібен пароль',
  passwordMinLength: 'Це поле має містити щонайменше 6 символів',
  usernameOrPasswordWrong: "Ім'я користувача або пароль неправильні",
  passwordIsEqual: 'Пароль має бути рівним попередньому паролю',
  usernameIsRequired: "Потрібне ім'я користувача",
  usernameInUse: 'Цей обліковий запис уже існує',
  ageIsRequired: 'Потрібен вік',
  firstNameIsRequired: "Потрібне ім'я",
  lastNameIsRequired: 'Потрібне прізвище ',
  genderIsRequired: 'Потрібна стать',
  locationIsRequired: 'Потрібне розташування',
  descriptionIsRequired: 'Потрібен опис',
  titleIsRequired: 'Потрібна назва',
  maxLength: 'Максимальна дозволена довжина {num}',
  submit: 'Підтвердити',
  back: 'Назад',
  home: 'Головна',
  find: 'Пошук половинки',
  AboutUs: 'Про нас',
  AboutCompany: 'Про компанію',
  moreAboutUs:
    'Ми - творці цифрових вражень, спрямованих на ваш успіх та задоволення. Наша команда віддана ідеї змінити ваше онлайн-досвід назавжди.',
  welcomeAbout1:
    'Наша компанія є лідером у сфері інноваційних рішень та технологій. Ми прагнемо до створення продуктів, які перевершують очікування наших клієнтів і сприяють їхньому успіху. Наша команда складається з висококваліфікованих фахівців, які працюють над тим, щоб забезпечити найвищу якість інноваційних рішень для наших клієнтів у всьому світі.',
  welcomeAbout2:
    'Наша місія - створювати продукти, які змінюють світ, розвивають галузі та вдосконалюють життя людей. Ми постійно шукаємо нові можливості та інноваційні шляхи досягнення успіху, будуючи довгострокові стосунки з нашими клієнтами на основі взаємного довіри, зростаючої вартості та взаємовигідності. Наша компанія завжди віддана своїм цілям і завданням, працюючи наполегливо, щоб бути кращими завтра, ніж ми були сьогодні.',
  minAge: 'Мін. вік',
  maxAge: 'Макс. вік',
  selectChat: 'Виберіть чат, щоб почати спілкування'
}
